{"pageProps":{"title":"Interview Prep for FAANG","dateString":"2024-08-14","slug":"leetcode-faang","description":"","tags":["FAANG","Interview","Leetcode","Algorithms","Data Structures","Graphs"],"author":"bebrws","source":{"compiledSource":"\"use strict\";\n\nvar _excluded = [\"components\"];\nfunction _extends() { _extends = Object.assign ? Object.assign.bind() : function (target) { for (var i = 1; i < arguments.length; i++) { var source = arguments[i]; for (var key in source) { if (Object.prototype.hasOwnProperty.call(source, key)) { target[key] = source[key]; } } } return target; }; return _extends.apply(this, arguments); }\nfunction _objectWithoutProperties(source, excluded) { if (source == null) return {}; var target = _objectWithoutPropertiesLoose(source, excluded); var key, i; if (Object.getOwnPropertySymbols) { var sourceSymbolKeys = Object.getOwnPropertySymbols(source); for (i = 0; i < sourceSymbolKeys.length; i++) { key = sourceSymbolKeys[i]; if (excluded.indexOf(key) >= 0) continue; if (!Object.prototype.propertyIsEnumerable.call(source, key)) continue; target[key] = source[key]; } } return target; }\nfunction _objectWithoutPropertiesLoose(source, excluded) { if (source == null) return {}; var target = {}; var sourceKeys = Object.keys(source); var key, i; for (i = 0; i < sourceKeys.length; i++) { key = sourceKeys[i]; if (excluded.indexOf(key) >= 0) continue; target[key] = source[key]; } return target; }\n/* @jsxRuntime classic */\n/* @jsx mdx */\n\nvar layoutProps = {};\nvar MDXLayout = \"wrapper\";\nfunction MDXContent(_ref) {\n  var components = _ref.components,\n    props = _objectWithoutProperties(_ref, _excluded);\n  return mdx(MDXLayout, _extends({}, layoutProps, props, {\n    components: components,\n    mdxType: \"MDXLayout\"\n  }), mdx(\"h1\", null, \"leetcode-faangFAANG Interviews and LeetCode\"), mdx(\"h2\", null, \"A Past Experience\"), mdx(\"p\", null, \"I think I have always been embarrassed by an interview I had with Google when I was fresh out of college. I choked on a simpler problem (now that I look back on it).\"), mdx(\"p\", null, \"Exhausted from the 8-hour final interview day, in the last round, I was asked to solve a problem involving determining the coordinates of an array of heights that would hold the maximum amount of water, if I remember correctly. I just choked, and once I believed I wouldn\\u2019t be able to find a solution, panic set in, and it became a reality.\"), mdx(\"p\", null, \"Lesson learned there: Keep calm. Think. Talk. Do whatever you can to try and move forward. Who knows, maybe I would have even gotten some help if I hadn\\u2019t just frozen up.\"), mdx(\"p\", null, \"Ironically, recently my parent company was acquired, and I received a message from Meta for an interview, so I decided to give it all a second shot. Thus began the long, arduous, multi-month process of interviews and coding challenges.\"), mdx(\"p\", null, \"I was told to study LeetCode\\u2014medium to hard problems.\"), mdx(\"p\", null, \"Since then, I\\u2019ve been doing so, and unfortunately, since it has been years since college, where I would have learned helpful algorithms, and I have rarely come across anything at work that is useful for these LeetCode problems, I have been relying on my memory and data structure knowledge to do my best to work through problems\"), mdx(\"h2\", null, \"Leetcode is Challenging\"), mdx(\"p\", null, \"These problems honestly make me feel like I have no chance with this interview process. I have heard that in the first interview, I can expect to solve two medium-level problems, each in 15 minutes.\"), mdx(\"p\", null, \"Sure, I could do this with an O(N^2) solution, but I know that isn\\u2019t what they are looking for, and it honestly seems like half the problems have specific solutions relevant only to that problem.\"), mdx(\"p\", null, \"HOWEVER, I have found myself building a repertoire of algorithms and possibly patterns that can be reused for specific problems or subsets of problems.\"), mdx(\"p\", null, \"I was especially afraid of graphs, but actually, I solved one of these the easiest, with a decent solution compared to others, and \", mdx(\"a\", {\n    parentName: \"p\",\n    \"href\": \"https://leetcode.com/problems/number-of-islands/solutions/5637250/simple-efficient-javascript-recursive-search-using-an-array-and-set-solution/\"\n  }, \"posted it here\"), \".\"), mdx(\"h2\", null, \"LeetCode Is Actually Pretty Fun and Rewarding\"), mdx(\"p\", null, \"When you do find that you have the right algorithm or pattern in your pocket and can identify where to use it, it\\u2019s a great feeling.\"), mdx(\"p\", null, \"While I am sure I won\\u2019t be implementing a quickSelect algorithm (when I can use a pre-existing data structure such as a priority queue, for example) in my day-to-day work, it has been a great learning experience and a great way to keep myself challenged and learning.\"), mdx(\"p\", null, \"Even though I will probably perform poorly in the interview, as I didn\\u2019t give myself much, if any, time to prepare, I am glad I finally added a new way of learning and staying sharp.\"), mdx(\"p\", null, \"Instead of my usual approaches of finding projects to create, tooling to make, or applications to reverse engineer, I can say that giving LeetCode a try was a great choice.\"));\n}\n;\nMDXContent.isMDXComponent = true;","renderedOutput":"<h1>leetcode-faangFAANG Interviews and LeetCode</h1><h2>A Past Experience</h2><p>I think I have always been embarrassed by an interview I had with Google when I was fresh out of college. I choked on a simpler problem (now that I look back on it).</p><p>Exhausted from the 8-hour final interview day, in the last round, I was asked to solve a problem involving determining the coordinates of an array of heights that would hold the maximum amount of water, if I remember correctly. I just choked, and once I believed I wouldn’t be able to find a solution, panic set in, and it became a reality.</p><p>Lesson learned there: Keep calm. Think. Talk. Do whatever you can to try and move forward. Who knows, maybe I would have even gotten some help if I hadn’t just frozen up.</p><p>Ironically, recently my parent company was acquired, and I received a message from Meta for an interview, so I decided to give it all a second shot. Thus began the long, arduous, multi-month process of interviews and coding challenges.</p><p>I was told to study LeetCode—medium to hard problems.</p><p>Since then, I’ve been doing so, and unfortunately, since it has been years since college, where I would have learned helpful algorithms, and I have rarely come across anything at work that is useful for these LeetCode problems, I have been relying on my memory and data structure knowledge to do my best to work through problems</p><h2>Leetcode is Challenging</h2><p>These problems honestly make me feel like I have no chance with this interview process. I have heard that in the first interview, I can expect to solve two medium-level problems, each in 15 minutes.</p><p>Sure, I could do this with an O(N^2) solution, but I know that isn’t what they are looking for, and it honestly seems like half the problems have specific solutions relevant only to that problem.</p><p>HOWEVER, I have found myself building a repertoire of algorithms and possibly patterns that can be reused for specific problems or subsets of problems.</p><p>I was especially afraid of graphs, but actually, I solved one of these the easiest, with a decent solution compared to others, and <a href=\"https://leetcode.com/problems/number-of-islands/solutions/5637250/simple-efficient-javascript-recursive-search-using-an-array-and-set-solution/\">posted it here</a>.</p><h2>LeetCode Is Actually Pretty Fun and Rewarding</h2><p>When you do find that you have the right algorithm or pattern in your pocket and can identify where to use it, it’s a great feeling.</p><p>While I am sure I won’t be implementing a quickSelect algorithm (when I can use a pre-existing data structure such as a priority queue, for example) in my day-to-day work, it has been a great learning experience and a great way to keep myself challenged and learning.</p><p>Even though I will probably perform poorly in the interview, as I didn’t give myself much, if any, time to prepare, I am glad I finally added a new way of learning and staying sharp.</p><p>Instead of my usual approaches of finding projects to create, tooling to make, or applications to reverse engineer, I can say that giving LeetCode a try was a great choice.</p>","scope":{"slug":"leetcode-faang","title":"Interview Prep for FAANG","date":"2024-08-14","author":"bebrws","tags":["FAANG","Interview","Leetcode","Algorithms","Data Structures","Graphs"]}}},"__N_SSG":true}